<a href="https://colab.research.google.com/github/GNuSeekK/ICTCOG/blob/main/2_3_%5BPandas%5D_DataFrame%2C_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Pandas의 Series, DataFrame
* 한 종류의 데이터를 모아 놓은 것 - Series
* Series가 여러 개 모이면 DataFrame이 된다.

## Series

In [ ]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
type(pd.Series([1,2,3,4]))

pandas.core.series.Series

## DataFrame
* Series가 여러 개 모여서 하나의 데이터 시트를 표현하면 DataFrame이 된다.

### 방법 1 : list로만 만들기
* 컬럼의 이름을 따로 지정해야 할 상황이 생김 -> 권장 x

In [ ]:
sample_data = [['소민호', 34, 180.0],
               ['이기성', 25, 170.1],
               ['박땡땡', 28, 183.2]]
pd.DataFrame(sample_data)

     0   1      2
0  소민호  34  180.0
1  이기성  25  170.1
2  박땡땡  28  183.2

In [ ]:
df1 = pd.DataFrame(sample_data)
df1

     0   1      2
0  소민호  34  180.0
1  이기성  25  170.1
2  박땡땡  28  183.2

In [ ]:
df1.columns = ['이름', '나이', '키']
df1

    이름  나이      키
0  소민호  34  180.0
1  이기성  25  170.1
2  박땡땡  28  183.2

### 방법 2 : dict로 만들기 - ver 1
* 자주 사용

In [ ]:
# dict의 키 - 컬럼의 이름
# dict의 value - '반드시' 리스트로 이루어져 있어야 한다.
# 모든 value의 리스트는 반드시 길이가 맞아야 한다.

In [ ]:
sample_data = {
    '이름' : ['소민호','임땡땡','김땡땡'],
    '나이' : [34,26,20],
    '키' : [180.1,170.2,173.5]
}
pd.DataFrame(sample_data)

    이름  나이      키
0  소민호  34  180.1
1  임땡땡  26  170.2
2  김땡땡  20  173.5

### 방법 2 : dict로 만들기 - ver 2
* json 크롤링 했을 때, 데이터를 바로 DataFrame화 시키고 싶을 때 사용
* json을 이용해 데이터를 가져올 때 일반적인 모습
```javascript
json_data = {
            "result" : [
                {
                    '이름' : '소민호'
                    '나이' : 34
                    '키' : 180.1
                },
                {
                    ...
                },
                {
                    ...
                }
            ]
            ...
        }
```
___
```python
result = json_data['result']
```

In [ ]:
sample_data = [
  {
    "이름" : "소민호",
    "나이" : 34,
    "키": 180.1
  },
  {
    "이름": "김땡땡",
    "나이" : 33,
    "키": 175.5
  },
  {
    "이름" : "박땡땡",
    "나이" : 28,
    "키": 183.2
  }
]

pd.DataFrame(sample_data)

    이름  나이      키
0  소민호  34  180.1
1  김땡땡  33  175.5
2  박땡땡  28  183.2